package com.broton.enote.dto.common;

/**
 * @title 回傳代碼
 * @description 各類回傳代碼
 */
public enum ResultCode {
	
	ERR_0000("0000","Success")
	,ERR_1001("1001","The parameter is invalid.")
	
	,ERR_2023("2023","內部專案密鑰不符")
	
	,ERR_3028("3028","取得據點列表錯誤")
	
	,ERR_3101("3101","閒置時間過久或不是合法的使用者")
	
	,ERR_4000("4000","物件轉換失敗")
	,ERR_4001("4001","手機號碼格式錯誤")
	,ERR_40012("40012","身份證/居留證號格式錯誤")
	,ERR_4002("4002","API溝通發生錯誤")
	
	,ERR_5001("5001","ERP 取得客戶資料列表錯誤")
	,ERR_5002("5002","取得客戶資料列表錯誤,請輸入查詢條件(手機,姓名,客代關鍵字)")
	,ERR_5003("5003","新增客戶錯誤")
	,ERR_5004("5004","刪除客戶錯誤,客戶資料不存在")
	,ERR_5005("5005","刪除客戶錯誤")
	,ERR_5006("5006","修改客戶錯誤,客戶資料不存在")
	,ERR_5007("5007","修改客戶錯誤")
	,ERR_5008("5008","不存在的客戶")
	,ERR_5009("5009","取得客戶資料錯誤")
	,ERR_5010("5010","取得客戶資料錯誤,不存在的客戶")
	,ERR_5011("5011","身份證/居留號檢核失敗")
	
	,ERR_5101("5101","會員註冊錯誤,手機號碼重複")
	,ERR_5102("5102","會員註冊錯誤,手機號碼格式錯誤")
	,ERR_5103("5103","會員註冊錯誤,密碼長度過短,最少6碼")
	,ERR_5104("5104","會員註冊錯誤,密碼長度過長,最多10碼")
	,ERR_5105("5105","會員註冊錯誤")
	,ERR_5106("5106","此身份證字號已有註冊資料")
	,ERR_5107("5107","此手機號已有註冊資料")
	
	,ERR_5201("5201","發送簡訊錯誤")
	,ERR_5202("5202","超過簡訊驗證碼有效期限")
	,ERR_5203("5203","驗證失敗,錯誤的簡訊驗證碼")	
	,ERR_5204("5204","簡訊驗證錯誤")
	
	,ERR_5301("5301","此會員為停用狀態")
	,ERR_5302("5302","登入失敗,帳號或密碼錯誤")	
	,ERR_5303("5303","此管理人員為停用狀態")
	,ERR_5304("5304","ERP 登入失敗")
	,ERR_5305("5305","取得片語失敗,請輸入查詢條件")
	,ERR_5306("5306","ERP 取得片語失敗")
	,ERR_5307("5307","ERP 取得客戶已簽署PDF清單失敗")
	,ERR_5308("5308","上傳 ERP 新的客戶簽署表單失敗")
	,ERR_5309("5309","ERP 以紀錄UNID下載特定的pdf檔案失敗")
	,ERR_5310("5310","依客戶編號查詢剩餘課程資料失敗")
	,ERR_5311("5311","重新上傳新的客戶簽署表單失敗")
	,ERR_5312("5312","上傳新增客戶PDF失敗")
	,ERR_5313("5313","pdf填入病歷號碼錯誤")
	
	,ERR_5401("5401","刪除超過期限未完成程序的會員註冊資料錯誤")
	
	,ERR_5501("5501","取得管理人員資料列表錯誤")
	,ERR_5502("5502","新增管理人員錯誤,帳號重複")
	,ERR_5503("5503","新增管理人員錯誤")
	,ERR_5504("5504","刪除管理人員錯誤,管理人員資料不存在")
	,ERR_5505("5505","刪除管理人員錯誤")
	,ERR_5506("5506","修改管理人員錯誤,管理人員資料不存在")
	,ERR_5507("5507","修改管理人員錯誤")
	
	,ERR_5600("5600","訂位資料不存在")
	,ERR_5601("5601","取得訂位資料錯誤")
	,ERR_5602("5602","新增訂位錯誤")
	,ERR_5603("5603","刪除訂位錯誤,訂位資料不存在")
	,ERR_5604("5604","刪除訂位錯誤")
	,ERR_5605("5605","修改訂位錯誤,訂位資料不存在")
	,ERR_5606("5606","修改訂位錯誤")
	,ERR_5607("5607","取得指定日期所有時段訂位狀態")
	
	,ERR_5701("5701","取得表單資料列表錯誤")
	,ERR_5702("5702","取得表單PDF錯誤")
	,ERR_5703("5703","取得表單PDF錯誤,表單資料不存在")
	,ERR_5704("5704","取得表單控制項列表錯誤")
	,ERR_5705("5705","新增表單錯誤")
	,ERR_5706("5706","更新表單錯誤")
	,ERR_5707("5707","表單上/下架錯誤")
	,ERR_5708("5708","取得表單&座標資訊錯誤")
	,ERR_5709("5709","新增表單錯誤,表單名稱重複")
	,ERR_5710("5710","新增表單輸入項目錯誤")
	,ERR_5711("5711","修改表單輸入項目錯誤")
	,ERR_5712("5712","修改表單輸入項目錯誤,表單輸入資料不存在")
	,ERR_5713("5713","刪除表單輸入項目錯誤")
	,ERR_5714("5714","刪除表單輸入項目錯誤,表單輸入資料不存在")
	,ERR_5715("5715","刪除表單錯誤")
	,ERR_5716("5716","刪除表單錯誤,表單資料不存在")
	,ERR_5717("5717","平板上傳log檔案錯誤")
	,ERR_5718("5718","平板新增客戶錯誤")
	
	,ERR_5801("5801","取得文件類別列表錯誤")
	
	,ERR_5901("5901","取得文件名稱列表錯誤")
	
	,ERR_5950("5950","取得設備狀態列表錯誤")
	,ERR_5951("5951","接收設備發送的設備狀態錯誤")	
	,ERR_5952("5952","新增/修改設備錯誤")
	,ERR_5953("5953","不存在的設備ID")
	,ERR_5954("5954","請指定設備ID")
	
	,ERR_5961("5961","取得據點列表錯誤")
	,ERR_5962("5962","新增據點錯誤,據點名稱重複")
	,ERR_5963("5963","新增據點錯誤")
	,ERR_5964("5964","修改據點錯誤,據點名稱重複")
	,ERR_5965("5965","修改據點錯誤,據點資料不存在")
	,ERR_5966("5966","修改據點錯誤")
	
	,ERR_5971("5971","ERP 取得醫師列表錯誤")
	,ERR_5972("5972","取得醫師印章錯誤")
	,ERR_5973("5973","醫師資料不存在")
	,ERR_5974("5974","產出醫師印章錯誤")
	,ERR_5975("5975","ERP 取得客戶資料錯誤")
	
	,ERR_5981("5981","上傳暫存表單錯誤")
	,ERR_5982("5982","查無暫存表單資料")
	,ERR_5983("5983","取得暫存表單群組錯誤")	
	,ERR_5984("5984","取得暂存表單清單")
	,ERR_5985("5985","取得暂存表單錯誤")
	
	,ERR_5990("5990","取得上傳日誌列表錯誤")
	,ERR_5991("5991","上傳日誌表單資料不存在")
	,ERR_5992("5992","取得上傳日誌表單錯誤")
	,ERR_5993("5993","刪除超過保留期限的上傳日誌錯誤")
	,ERR_5994("5994","取得表單暫存列表錯誤")
	,ERR_5995("5995","表單暫存棄用錯誤")
	,ERR_59951("59951","解除表單暫存鎖定錯誤")
	,ERR_59952("59952","設定表單暫存鎖定錯誤")
	,ERR_5996("5996","表單暫存資料不存在")
	,ERR_5997("5997","取得表單暫存pdf,簽名軌跡錯誤")
	,ERR_5998("5998","表單暫存錯誤")
	,ERR_5999("5999","取得表單暫存錯誤")
	,ERR_59991("59991","取得表單暫存錯誤,表單已被鎖定")
	
	,ERR_6001("6001","此份表單暫存資料已被上傳")
	,ERR_6002("6002","此份表單暫存資料已被棄用")
	
	,ERR_9999("9999","Unforeseen exceptions.");
	
	ResultCode(String pCode,String pDesc){
		this.code = pCode;
		this.desc = pDesc;
	}
	private String code;
	private String desc;
	
	public String getCode() {
		return code;
	}
	public String getDesc() {
		return desc;
	}

}
